---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn2
source: html/705c517f-2fad-44b5-f7c2-b28b9df3a6a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeTopDirn2 Property

"Top Minor Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeTopDirn2 { get; }
```